local _, ns = ...
local B, C, L, DB, P = unpack(ns)

P.Changelog = [[
v1.15.12
[主要] 更新版本号至1.15.7
[美化] 更新部分插件美化

v1.15.11
[主要] 更新版本号至1.15.6
[易用性] 快速切换头盔和披风外观
[美化] 添加 SimpleAddonManager 美化
[美化] 添加 RareScanner 美化
[美化] 添加 Ranker 美化
[美化] 更新部分插件美化

v1.15.10
[动作条] 修复法师动作条状态更新
[背包] 离线背包添加装备等级显示
[美化] 更新部分插件美化

v1.15.9
[美化] 更新部分插件美化

v1.15.8
[主要] 更新支持 1.15.5
[背包] 修复离线背包角色切换
[易用性] 修复训练师面板扩展报错
[美化] 更新 WeakAurasOptions 美化

v1.15.7
[易用性] 修复启用Roll点增强，按下shift时鼠标提示未正常隐藏的问题
[易用性] 提前加载商人面板扩展，以兼容其他插件
[美化] 更新 WA 美化tips
[美化] 更新部分插件美化

v1.15.6
[主要] 移除旧版本兼容性代码
[美化] 更新部分插件美化

v1.15.5
[主要] 更新支持 PTR 1.15.3
[聊天] 修复启用聊天框隐藏时背景层级问题
[易用性] 符文页面添加未收集符文列表

v1.15.4
[易用性] 天赋扩展支持双天赋
[美化] 更新部分插件美化

v1.15.3
[美化] 更新部分插件美化

v1.15.2
[动作条] 添加终结技满星高亮
[动作条] 符文动作条仅在SoD服务器加载、调整弹出按钮渐隐延迟
[易用性] 符文界面增强添加控制台开关, 右键点击时不再快速切换
[美化] 更新部分插件美化

v1.15.1
[动作条] 新增独立符文动作条
[易用性] 增强暴雪符文界面, 点击快速切换符文; 高亮显示当前符文

v1.15.0
[主要] 更新至1.15.0
[美化] 更新部分插件美化
]]