local _, ns = ...
local B, C, L, DB, P = unpack(ns)

P.Changelog = [[
v1.4.5
[鼠标提示] 更新盟约图标显示方式
[美化] 更新部分插件美化

v1.4.4
[鼠标提示] 添加盟约图标
[美化] 添加ImprovedAddonList美化
[美化] 更新部分插件美化

v1.4.3
[任务] 移除荒蚺和顽石之重任务助手
[美化] 添加BtWLoadouts美化

v1.4.2
[任务] 更新任务助手
[易用性] 添加宏图标搜索
[天赋管理] 移除无效的PvP天赋
[美化] 更新MeetingStone美化

v1.4.1
[鼠标提示] 地下城信息显示超时颜色
[易用性] 添加刻希亚稀有逃跑的荒蚺助手

v1.4.0
[主要] 更新支持9.1
[美化] 更新部分插件美化
[鼠标提示] PvE进度信息添加新版本数据，地下城信息由副本次数更新为暴雪副本评分和最高层数
[易用性] 添加暂离界面
[易用性] 修复复制幻化
[易用性] 移除顿号转斜杠

v1.3.11
[美化] 修复WeakAurasOptions报错

v1.3.10
[报错] 修复一个加载错误

v1.3.9
[美化] 兼容旧版MeetingStone

v1.3.8
[美化] 更新Immersion美化
[美化] 更新MeetingStone美化

v1.3.7
[美化] 添加Auctionator美化
[鼠标提示] PvE进度信息支持自定义成就
[其他] 预组建队伍职责美化支持集合石插件

v1.3.6
[美化] 移除和新增部分材质
[美化] 添加其他风格职责图标
[鼠标提示] PvE进度信息只统计9.0大秘境次数
[易用性] 移除商人界面装备等级显示、移除试衣间增强

v1.3.5
[聊天] 修复聊天框隐藏

v1.3.4
[聊天] 添加聊天框隐藏
[美化] 添加Extended Vendor UI美化
[易用性] 添加选项隐藏未学天赋提醒
[易用性] 添加商人界面装备等级显示

v1.3.3
[单位框体] 修复姓名版字体颜色错误

v1.3.2
[单位框体] 修复白色姓名文本和职责图标在团队框体未生效的问题

v1.3.1
[鼠标提示] 修复对比成就时可能出现的报错

v1.3.0
|cffFF1414重写控制台|r，部分选项需要重新设置
[动作条] 重写全局渐隐
[单位框体] 添加单位框体渐隐
[鼠标提示] 添加PvE进度信息 (ElvUI_WindTools)
[易用性] 添加一键复制幻化 (CopyMog)

v1.2.8
[美化] 美化兼容DungeonTools
[美化] 更新Immersion美化
[其他] 添加双击专精图标快速切换专精功能
[天赋管理] 添加天赋管理功能
[拾取管理] |cffFF1414重置|r拾取配置文件，修复某些情况副本显示不完整的问题; 移除默认专精选项

v1.2.7
[任务] 添加暗影国度世界任务助手
[美化] 添加WorldQuestTab美化
[其他] 添加鼠标提示坐骑来源
[其他] 添加拾取专精管理, 支持团队副本和大秘境。命令：/lsm 或者冒险手册界面打开

v1.2.6
[材质] 材质替换支持LibSharedMedia
[材质] 添加WindMedia材质包
[材质] 添加Lyn风格职责图标
[战斗] 切换动作条时刷新终结技高亮
[美化] 更新MeetingStone美化

v1.2.5
[战斗] 添加终结技高亮
[美化] 添加Myslot美化
[美化] 更新AceGUI美化

v1.2.4
|cffFF1414重置配置文件|r，需要重新进行设置
[聊天] 添加超链接图标
[聊天] 修复离队玩家仍会显示小队编号的问题
[美化] 更新WeakAurasOptions美化
[美化] 添加RareScanner美化
[全局渐隐] 拖动法术时自动显示动作条
[全局渐隐] 修复可能造成的污染

v1.2.3
[全局渐隐] 修复动作条背景无法点击穿透的问题

v1.2.2
添加全局渐隐，支持NDui动作条/头像
添加聊天姓名染色
添加聊天小队编号
美化兼容MeetingStonePlus

v1.2.1
修复部分插件美化

v1.2.0
更新支持9.0
]]