local _, ns = ...
local B, C, L, DB, P = unpack(ns)

P.Changelog = [[
v4.4.4
[易用性] 修复启用Roll点增强，按下shift时鼠标提示未正常隐藏的问题
[易用性] 提前加载商人面板扩展，以兼容其他插件
[美化] 更新 WA 美化tips
[美化] 更新部分插件美化

v4.4.3
[美化] 更新部分插件美化

v4.4.2
[聊天] 修复启用聊天框隐藏时背景层级问题
[美化] 修复 ReforgeLit 美化
[美化] 修复 Restocker 美化
[美化] 修复 ThreatClassic2 美化
[易用性] 移除雕文面板鼠标滚动修复

v4.4.1
[动作条] 更新终结技高亮法术列表
[易用性] 添加兽栏面板扩展
[易用性] 移除公会面板扩展
[美化] 添加 ReforgeLit 美化
[美化] 修复 Krowi_AchievementFilter 美化
[美化] 修复 AutoBarCata 美化
[易用性] 修复暴雪雕文面板鼠标滚动
[易用性] 修复暴雪角色面板自动扩展

v4.4.0
[主要] 更新版本号至4.4.0
[动作条] 移除法师动作条
[聊天] 修复启用聊天框隐藏时背景层级问题
[易用性] 移除天赋面板扩展, 默认UI支持双击切换天赋
[易用性] Roll点增强支持"分解"选项，热修后生效
[美化] 更新MerInspect美化
]]