local _, ns = ...
local B, C, L, DB, P = unpack(ns)

P.Changelog = [[
v1.3.0
|cffFF1414重写控制台|r，部分选项需要重新设置
[动作条] 重写全局渐隐
[单位框体] 添加单位框体渐隐
[鼠标提示] 添加PvE进度信息

v1.2.8
[美化] 美化兼容DungeonTools
[美化] 更新Immersion美化
[其他] 添加双击专精图标快速切换专精功能
[天赋管理] 添加天赋管理功能
[拾取管理] |cffFF1414重置|r拾取配置文件，修复某些情况副本显示不完整的问题; 移除默认专精选项

v1.2.7
[任务] 添加暗影国度世界任务助手
[美化] 添加WorldQuestTab美化
[其他] 添加鼠标提示坐骑来源
[其他] 添加拾取专精管理, 支持团队副本和大秘境。命令：/lsm 或者冒险手册界面打开

v1.2.6
[材质] 材质替换支持LibSharedMedia
[材质] 添加WindMedia材质包
[材质] 添加Lyn风格职责图标
[战斗] 切换动作条时刷新终结技高亮
[美化] 更新MeetingStone美化

v1.2.5
[战斗] 添加终结技高亮
[美化] 添加Myslot美化
[美化] 更新AceGUI美化

v1.2.4
|cffFF1414重置配置文件|r，需要重新进行设置
[聊天] 添加超链接图标
[聊天] 修复离队玩家仍会显示小队编号的问题
[美化] 更新WeakAurasOptions美化
[美化] 添加RareScanner美化
[全局渐隐] 拖动法术时自动显示动作条
[全局渐隐] 修复可能造成的污染

v1.2.3
[全局渐隐] 修复动作条背景无法点击穿透的问题

v1.2.2
添加全局渐隐，支持NDui动作条/头像
添加聊天姓名染色
添加聊天小队编号
美化兼容MeetingStonePlus

v1.2.1
修复部分插件美化

v1.2.0
更新支持9.0
]]