local _, ns = ...
local B, C, L, DB, P = unpack(ns)

P.Changelog = [[
v12.1.1
[主要] 更新版本号至12.1.5
[动作条] 更新全局渐隐，支持微型菜单渐隐
[单位框体] 修复NDui单位框体职责图标替换
[战斗] 移植快速焦点功能，支持单位框体焦点标记
[鼠标提示] PvE进度更新团本和钥石成就数据
[鼠标提示] 修复秘密值错误
[美化] 添加 TomTom 美化
[美化] 更新部分插件美化

v12.1.0
[主要] 更新版本号至12.1.0
[单位框体] 修复NDui单位框体职责图标不显示的问题
[单位框体] 修复单位框体渐隐报错
[战斗] 为NDui快速焦点添加标记功能
[聊天] 重构聊天框职责图标避免污染
[易用性] 修复启用Roll点增强时暴雪框体未隐藏的问题
[易用性] 修复德鲁伊变形形态时幻化列表为空的问题
[易用性] 冒险手册中显示套装标签页
[鼠标提示] PvE进度更新至暗之夜S2数据
[鼠标提示] 修复部分Forbidden报错
[美化] 添加 M33kAuras 美化
[美化] 更新 MeetingStone 美化
[美化] 更新 KeystoneLoot 美化
[美化] 修复 WorldQuestTab 美化
[美化] 修复 MDT 美化

v12.0.3
[聊天] 修复聊天框锚点错误
[易用性] 启用自动Roll点时，自动确认拾取绑定对话框
[美化] 修复材质列表中缺失部分LibSharedMedia材质的问题
[美化] 更新 WorldQuestTab 美化
[美化] 更新 KeystoneLoot 美化

v12.0.2
[单位框体] 修复NDui单位框体职责图标替换
[鼠标提示] PvE进度更新至暗之夜S1数据
[美化] 添加 Clique 美化
[美化] 更新部分插件美化

v12.0.1
[易用性] 修复幻化文本复制
[鼠标提示] 修复ouf光环坐骑来源
[美化] 更新部分插件美化

v12.0.0 
[主要] 更新版本号至12.0.0
[调整] 动作条渐隐和单位框架渐隐移除"生命值"触发条件
[美化] 更新部分插件美化
]]